# Задание №1
num1, num2 = int(input("Введите целое число: ")), int(input("Введите целое число: "))
string1 = input("Введите строку: ")
float_number = float(input("Введите вещественное число: "))

print(string1, num1, num2, float_number)

# Задание №2
num1 = int(input("Введите целое число: "))
float_number = float(input("Введите вещественное число: "))
bool_value = bool(input("Введите True или False: "))
string1 = input("Введите строку: ")

print(str(num1))
print(str(float_number))
print(str(bool_value))
print(string1)

# Задание №3
name = input("Введите Имя: ")
lastname = input("Введите Фамилию: ")
patronymic = input("Введите Отчество: ")
age = input("Введите Возраст: ")
city = input("Введите Город проживания: ")

print(lastname, name, patronymic)
print(age)
print(city)
